flow_agent/src/scrape

----- Login --------


POST /sdk HTTP/1.1\r
Host: localhost\r
User-Agent: Go-http-client/1.1\r
Transfer-Encoding: chunked\r
Content-Type: text/xml; charset="utf-8"\r
Soapaction: urn:vim25/7.0\r
Accept-Encoding: gzip\r
\r
> 2025/11/21 21:55:33.000128160  length=45 from=640 to=684
27\r
<?xml version="1.0" encoding="UTF-8"?>
\r
> 2025/11/21 21:55:33.000128235  length=276 from=685 to=960
10d\r
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><Login xmlns="urn:vim25"><_this type="SessionManager">SessionManager</_this><userName>administrator@vsphere.local</userName><password>#########</password><locale>en_US</locale></Login></Body></Envelope>\r
> 2025/11/21 21:55:33.000128545  length=5 from=961 to=965
0\r
\r


------ Send Key Press ---------


HTTP/1.1 200 OK\r
Date: Sat, 22 Nov 2025 02:55:39 GMT\r
Cache-Control: no-cache\r
Connection: Keep-Alive\r
Content-Type: text/xml; charset=utf-8\r
Content-Length: 414\r
\r
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<DestroyPropertyCollectorResponse xmlns="urn:vim25"></DestroyPropertyCollectorResponse>
</soapenv:Body>
</soapenv:Envelope>> 2025/11/21 21:55:41.000374754  length=260 from=13109 to=13368
POST /sdk HTTP/1.1\r
Host: localhost\r
User-Agent: Go-http-client/1.1\r
Transfer-Encoding: chunked\r
Content-Type: text/xml; charset="utf-8"\r
Cookie: vmware_soap_session=46d61c5ca4e126d04569669275ca54ed84d4a1fb\r
Soapaction: urn:vim25/7.0\r
Accept-Encoding: gzip\r
\r
> 2025/11/21 21:55:41.000375208  length=45 from=13369 to=13413
27\r
<?xml version="1.0" encoding="UTF-8"?>
\r
> 2025/11/21 21:55:41.000375284  length=361 from=13414 to=13774
162\r
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><PutUsbScanCodes xmlns="urn:vim25"><_this type="VirtualMachine">vm-681</_this><spec><keyEvents><usbHidCode>524295</usbHidCode><modifiers><leftControl>false</leftControl><leftShift>false</leftShift><leftAlt>false</leftAlt></modifiers></keyEvents></spec></PutUsbScanCodes></Body></Envelope>\r
> 2025/11/21 21:55:41.000375712  length=5 from=13775 to=13779
0\r
\r
